Show / Hide Table of Contents
Class CrossSectionThermalAttribute
Cross-section thermal attribute
Inheritance
System.Object
OpenObject
OpenAttribute
CrossSectionThermalAttribute
Inherited Members
 OpenAttribute.Element
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentsThermalAttribute,CI.CrossSection")]
public class CrossSectionThermalAttribute : OpenAttribute
Examples
This sample shows how to create thermal attributes on cross-section.
//Creating the model
OpenModel openModel = new OpenModel();
Set thermal definition - on component 0,
CrossSectionThermalAttribute thermalAttr = new CrossSectionThermalAttribute();
thermalAttr.Element = new ReferenceElement(css);
CrossSectionComponentThermalData thermalComp = new CrossSectionComponentThermalData();
thermalComp.MoistureContent = 0.015;
thermalComp.ThermalConductivityLimit = ThermalConductivityLimit.Lower;
thermalComp.ComponentIndex = 0;
thermalAttr.Components.Add(thermalComp);
openModel.AddObject(thermalAttr);
Constructors
Improve this Doc   View Source
CrossSectionThermalAttribute()
Constructor
Declaration
public CrossSectionThermalAttribute()
Properties
Improve this Doc   View Source
Components
List of components
Declaration
public List<CrossSectionComponentThermalData> Components { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CrossSectionComponentThermalData>
 Improve this Doc
 View Source